blake-mh-liu/ADCU_TC387/tresos/plugins/McalExt_TS_T16DxM1I0R0/MCAL_Delivery/McIsar/Src/Infra_Prod/Sfr/TC33xA/_Reg/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_OFF (7u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_OFF (8u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_OFF (9u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_OFF (10u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_OFF (11u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_OFF (12u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_OFF (13u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_OFF (14u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_OFF (15u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_OFF (16u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_OFF (17u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_OFF (18u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_OFF (19u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_OFF (20u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_OFF (21u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_OFF (22u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_OFF (23u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_OFF (24u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_OFF (25u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_OFF (26u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_OFF (27u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_LEN (1u)

/** \brief Mask for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_OFF (28u)

/** \brief Length for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_LEN (1u)

