blake-mh-liu/ADCU_TC387/tresos/plugins/McalExt_TS_T16DxM1I0R0/MCAL_Delivery/McIsar/Src/Infra_Prod/Sfr/TC33xA/_Reg/IfxEray_bf.h
/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP109 */
#define IFX_ERAY_NDIC4_NDIP109_OFF (13u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP110 */
#define IFX_ERAY_NDIC4_NDIP110_OFF (14u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP111 */
#define IFX_ERAY_NDIC4_NDIP111_OFF (15u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP112 */
#define IFX_ERAY_NDIC4_NDIP112_OFF (16u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP113 */
#define IFX_ERAY_NDIC4_NDIP113_OFF (17u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP114 */
#define IFX_ERAY_NDIC4_NDIP114_OFF (18u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP115 */
#define IFX_ERAY_NDIC4_NDIP115_OFF (19u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP116 */
#define IFX_ERAY_NDIC4_NDIP116_OFF (20u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP117 */
#define IFX_ERAY_NDIC4_NDIP117_OFF (21u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP118 */
#define IFX_ERAY_NDIC4_NDIP118_OFF (22u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP119 */
#define IFX_ERAY_NDIC4_NDIP119_OFF (23u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP120 */
#define IFX_ERAY_NDIC4_NDIP120_OFF (24u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP121 */
#define IFX_ERAY_NDIC4_NDIP121_OFF (25u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP122 */
#define IFX_ERAY_NDIC4_NDIP122_OFF (26u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP123 */
#define IFX_ERAY_NDIC4_NDIP123_OFF (27u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP124 */
#define IFX_ERAY_NDIC4_NDIP124_OFF (28u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP125 */
#define IFX_ERAY_NDIC4_NDIP125_OFF (29u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP126 */
#define IFX_ERAY_NDIC4_NDIP126_OFF (30u)

/** \brief Length for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDIC4_Bits.NDIP127 */
#define IFX_ERAY_NDIC4_NDIP127_OFF (31u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP0 */
#define IFX_ERAY_MSIC1_MSIP0_OFF (0u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_OFF (1u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_OFF (2u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_OFF (3u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_OFF (4u)

/** \brief Length for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_OFF (5u)

